#!/bin/bash

if [[ $# -ne 1 ]] ; then
        echo "Expected 1 argument - file name"
        exit 1
fi

if [[ ! -f "${1}" ]] ; then
        echo "File does not exist"
        exit 1
fi

counter=1

while read line ; do
        line=$(echo ${line} | awk -F '-' '{for (i=2;i<=NF;i++) print $i}')
        lines+="${counter}.${line}\n"
        counter=$(( counter + 1 ))
done < ${1}

echo -e ${lines} | sort -k2 -t '"'

#Имате текстов файл със следното съдържание (всяка книга е на един ред):
#1979 г. - „Синият тайфун“ (сборник съветски научнофантастични разкази за морето)
#1979 г. - „Двойната звезда“ - Любен Дилов
#1979 г. - „Завръщане от звездите“ - Станислав Лем (Превод: Веселин Маринов)
#1979 г. - „Среща с Рама“ - Артър Кларк (Превод: Александър Бояджиев)
#1979 г. - „Алиби“ - Димитър Пеев (криминален роман)
#1979 г. - „Тайнственият триъгълник“ (сборник НФ разкази за морето)
#1979 г. - „Второто нашествие на марсианците“ - Аркадий и Борис Стругацки
#1979 г. - „Гробищен свят“ - Клифърд Саймък (Превод: Михаил Грънчаров)
#1979 г. - „Чоки“ - Джон Уиндъм (Превод: Теодора Давидова)
#1979 г. - „Спускане в Маелстрьом“ - Едгар Алан По (Превод: Александър Бояджиев)
#1980 г. - „Допълнителна примамка“ - Робърт Ф. Йънг (Превод: Искра Иванова, ...)
#1980 г. - „Кристалното яйце“ - Хърбърт Уелс (Превод: Борис Миндов, ...)
#1980 г. - „Онирофилм“ (сборник италиански НФ разкази) (Превод: Никола Иванов, ...)
#Напишете shell script (приемащ аргумент име на файл) който извежда:
#• всеки ред от файла с добавен пореден номер във формат "1. ", "2. ", ... "11. " ...
#• махат данните за годината на издаване
#• сортират изхода по заглавие (лексикографски, възходящо)
#Примерен изход (показани са само първите 4 реда):
#5. „Алиби“ - Димитър Пеев (криминален роман)
#7. „Второто нашествие на марсианците“ - Аркадий и Борис Стругацки
#8. „Гробищен свят“ - Клифърд Саймък (Превод: Михаил Грънчаров)
#2. „Двойната звезда“ - Любен Дилов