#!/bin/bash

if [[ ${#} -lt 1 ]] || [[ ${#} -gt 2 ]] ; then
    echo "Expected 2 arguments"
    exit 1
fi

dir="${1}"
arch="${2}"

files=$(find "${dir}" -mindepth 1 -maxdepth 1 -type f -printf "%f\n" | egrep "^vmlinuz-[0-9]*[.][0-9]*[.][0-9]*-${arch}$")
result=$(echo "${files}" | awk -F '-' '{print $2 "." $0}' | tr '.' ' ' | sort -nr | tr ' ' '.' | head -n1 | cut -d '.' -f4- )

#echo "${result}"
#
#Напишете скрипт, който получава два задължителни позиционни параметъра –
#директория и низ. Сред файловете в директорията би могло да има такива, чиито имена имат
#структура vmlinuz-x.y.z-arch където:
#• vmlinuz е константен низ;
#• тиретата “-” и точките “.” присъстват задължително;
#• x е число, version;
#• y е число, major revision;
#• z е число, minor revision;
#• наредената тройка x.y.z формира глобалната версия на ядрото;
#• arch е низ, архитектура (платформа) за която е съответното ядро.
#Скриптът трябва да извежда само името на файла, намиращ се в подадената директория (но не и
#нейните поддиректории), който:
#• спазва гореописаната структура;
#• е от съответната архитектура спрямо параметъра-низ, подаден на скрипта;
#• има най-голяма глобална версия.
#Пример:
#• Съдържание на ./kern/:
#vmlinuz-3.4.113-amd64
#vmlinuz-4.11.12-amd64
#vmlinuz-4.12.4-amd64
#vmlinuz-4.19.1-i386
#• Извикване и изход:
#$ ./task1.sh ./kern/ amd64
#vmlinuz-4.12.4-amd64
