#!/bin/bash

if [[ $# -ne 3 ]] ; then
    echo "Expected 3 arguments"
    exit 1
fi

args1=$(cat "${1}" | egrep  "^${2}=" | awk -F '=' '{print $2}' | tr ' ' '\n')
args2=$(cat "${1}" | egrep  "^${3}=" | awk -F '=' '{print $2}' | tr ' ' '\n')

while read line ; do
    echo "${args1}" | grep -q -F "${line}"
    if [[ ${?} -ne 0 ]] ; then
                result+=$(echo "${line} ")
        fi
done < <(echo "${args2}")

sed -i -E "s/(${3}=).*/\1${result}/g" ${1}

#Напишете скрипт, който приема три задължителни позицонни аргумента:
#• име на фаил
#• низ1
#• низ2
#Файлът е текстови, и съдържа редове във формат:
#6
#ключ=стойност
#където стойност може да бъде:
#• празен низ, т.е. редът е ключ=
#• низ, състоящ се от един или повече термове, разделени с интервали, т.е., редът е ключ=t1 t2
#t3
#Някъде във файла:
#• се съдържа един ред с ключ първия подаден низ (низ1 );
#• и може да се съдържа един ред с ключ втория подаден низ (низ2 ).
#Скриптът трябва да променя реда с ключ низ2 така, че обединението на термовете на редовете с
#ключове низ1 и низ2 да включва всеки терм еднократно.
#Примерен входен файл:
#$ cat z1.txt
#FOO=73
#BAR=42
#BAZ=
#ENABLED_OPTIONS=a b c d
#ENABLED_OPTIONS_EXTRA=c e f
#Примерно извикване:
#$ ./a.sh z1.txt ENABLED_OPTIONS ENABLED_OPTIONS_EXTRA
#Изходен файл:
#$ cat z1.txt
#FOO=73
#BAR=42
#BAZ=
#ENABLED_OPTIONS=a b c d
#ENABLED_OPTIONS_EXTRA=e f

