#!/bin/bash

if [[ $# -gt 2 ]] || [[ $# -lt 1 ]] ; then
        echo "Expected 2 arguments - color and string"
        exit 1
fi

if [[ $# -eq 1 ]] ; then
        echo "${1}"
        exit 0
fi

color="${1}"
shift

if [[ ${color} == "-r" ]] ; then
        echo -e "\033[0;31m${@}"
elif [[ ${color} == "-g" ]] ; then
        echo -e "\033[0;32m${@}"
elif [[ ${color} == "-b" ]] ; then
        echo -e "\033[0;34m${@}"
else
        echo "Unknown color"
fi

echo -e '\033[0m'

#(Цветно принтиране) Напишете shell script color_print, който взима два параметъра.
#
#Първият може да е измежду "-r", "-g" "-b", а вторият е произволен string.
#На командата "echo" може да се подаде код на цвят, който ще оцвети текста в определения цвят.
#В зависимост от първия аргумент, изпринтете втория аргумен в определения цвят:
#
#"-r" е червено. Кодът на червеното е '\033[0;31m' (echo -e "\033[0;31m This is red")
#"-g" е зелено. Кодът на зеленото е '\033[0;32m' (echo -e "\033[0;32m This is green")
#"-b" е синьо. Кодът на синьото е '\033[0;34m' (echo -e "\033[0;34m This is blue")
#Ако е подадена друга буква изпишете "Unknown colour",
#а ако изобщо не е подаден аргумент за цвят, просто изпишете текста.
#
#Hint:
#
#В края на скрипта си напишете:
#echo -e '\033[0m'
#,за да не се прецакат цветовете на терминала. Това е цветът на "няма цвят".
