# Напишете серия от команди, които намират всички обикновени файлове, отговарящи едновременно
# на следните условия:
# • намират се в home директорията на текущия потребител, но не и в нейните под-директории;
# • собственик им е текущият потребител.
# Серията от команди трябва да променя правата на намерените файлове така, че да станат такива,
# каквито биха се получили, ако при създаването на файловете ефективната маска е била 0002.
# Гарантирайте, че серията от команди няма изход

find ~ -maxdepth 1 -type f -user $(whoami) | xargs -I{} chmod 775 {} >/dev/null
#or
find ~ -mindepth 1 -maxdepth 1 -type f -user $(id -u) 2>/dev/null | xargs -I{} chmod 775 {} >/dev/null
